#+Title: Why teaching functional programming to undergraduates at CUNY is important
#+Author: Evan Misshula
#+Email: emisshula@jjay.cuny.edu
#+Date: 2018-03-28

#+OPTIONS: H:2 toc:nil num:t
#+TAGS:       Write(w) Update(u) Fix(f) Check(c) noexport(n) export(e)
#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  en
#+STARTUP: beamer
#+EXPORT_SELECT_TAGS: export(e)
#+EXPORT_EXCLUDE_TAGS: noexport(n)
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presetation]
#+BEAMER_THEME: Madrid
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt)

*** Haskell is statically typed					    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
- Haskell allows students inquire about the type
  - We can see that type by using the ':t' command in the repl:
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output
   :t 'a'
   :t True
   :t "HELLO!"
   :t (True, 'a')
   :t 4 == 5
  1==1
#+End_src

#+RESULTS:
: 'a' :: Char
: True :: Bool
: "HELLO!" :: [Char]
: (True, 'a') :: (Bool, Char)
: 4 == 5 :: Bool

*** Haskell has functions that work on different types              :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
\pause
- These are polymorphic functions
  - examples
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output
  head [1,2,3]
  head "Evan"
  fst ("Evan","Misshula")
  snd (1,3)
  1==1
#+End_src

#+RESULTS:
: 1
: 'E'
: Evan
: 3

*** The Eq typeclass provides an interface for testing for equality   :block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
- Eq is used for types that support equality testing
  - Its members implement both:
    - '=='
    - '/='
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output
5==5
5/=5
'a' == 'a'
"Ho Ha" == "Ho Ha"
3.4 == 3.4
  1==1
#+End_src

#+RESULTS:
: True
: False
: True
: True
: True


*** Ord is for types that have an ordering 			    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
- We can see the type of '>' comparison
- We can see some functions which rely on being in the ord typeclass
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output
:t (>)
"Abc"< "Zev"
compare "Abc" "Zev"
5 >= 2
compare 5 3
1==1
#+End_src

#+RESULTS:
: (>) :: Ord a => a -> a -> Bool
: True
: LT
: True
: GT


*** Read is the inverse of show 				    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
- It works reads a string and returns a type which supports the interface Read
\pause
- You can use it to create Javascript like craziness
\pause
  - *But you have to work at it*
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output
read "True" || False                          
read "8.2" + 3.8                                    
read "5" - 2         
read "[1,2,3,4]" ++ [3]
1==1
#+End_src

#+RESULTS:
: True
: 12.0
: 3
: [1,2,3,4,3]

*** Let's look at a type error					    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output
read 4
1==1
#+End_src

#+RESULTS:
: <interactive>:238:6:
:     No instance for (Num String) arising from the literal `4'
:     Possible fix: add an instance declaration for (Num String)
:     In the first argument of `read', namely `4'
:     In the expression: read 4
:     In an equation for `it': it = read 4

- GHCI is saying it does not know what type to return
  - Do you want an Float or an Integer?

*** We can specify a type					    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
- We just add '::<Type>' and read will work
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output
read "5" :: Int
read "5" :: Float
(read "5" :: Int) * 4
read "[1,2,3,4]" :: [Int]
read "(3,'a')" :: (Int, Char)
1==1
#+End_src

#+RESULTS:
: 5
: 5.0
: 20
: [1,2,3,4]
: (3,'a')

*** Sequentially ordered types					    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
- Being /sequentialy ordered/ means that they can be counted in order
- This property is also called being /enumerable/
- We can use them in list ranges
  - they each have a predecessor which you can get with 'pred'
  - they each have a successor which you can get with 'succ'
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output
['a'..'e']
[LT .. GT]
[3..7]
succ 'B'
1==1
#+End_src

#+RESULTS:
: abcde
: [LT,EQ,GT]
: [3,4,5,6,7]
: 'C'

*** Bounded type class has concrete types			    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
- with maximum and minimum elements
  - minBound and maxBound are functions with polymorphic type
    - (Bounded a) => a
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output
minBound :: Int
maxBound :: Char
maxBound :: Bool
minBound :: Bool
i==i
#+End_src

#+RESULTS:
: -9223372036854775808
: '\1114111'
: True
: False

*** Numeric types can be operated on mathematically 		    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
- Let's look at this type
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output
:t (*)
(5 :: Int) * (6 :: Integer)
(5 :: Int) * 6
i==i
#+End_src

#+RESULTS:
: (*) :: Num a => a -> a -> a
: <interactive>:281:15:
:     Couldn't match expected type `Int' with actual type `Integer'
:     In the second argument of `(*)', namely `(6 :: Integer)'
:     In the expression: (5 :: Int) * (6 :: Integer)
:     In an equation for `it': it = (5 :: Int) * (6 :: Integer)
: 30

*** Integral and Floating types					    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
- The Integral typeclass only includes Integer and Int
- The Floating typeclass only includes floats and double
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output
:t fromIntegral
fromIntegral (length [1,2,3,4]) + 3.2
i==i
#+End_src

#+RESULTS:
: fromIntegral :: (Integral a, Num b) => a -> b
: 7.2


*** We can pass a lambda to ZipWith 				    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
- a lambda function in Haskell starts with '\'
- can't define several parameters for one para,eters
#+BEGIN_SRC haskell :session *plsHaskell* :exports code :results output
zipWith (\a b -> (a * 30 + 3) / b) [5,4,3,2,1] [1,2,3,4,5]
1==1
#+End_src

#+RESULTS:
: [153.0,61.5,31.0,15.75,6.6]

*** Function application with $					    :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
- '$' is called the /function application/
- changes to right association
- keeps us from writing parentheses

#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output
map ($ 3) [(4+), (10*), (^2), sqrt]
1==1
#+End_src

#+RESULTS:
: [7.0,30.0,9.0,1.7320508075688772*** Exception: <interactive>:1943:1-29: Non-exhaustive patterns in function map

*** Function composition examples
- with a \lambda
- with point free notation
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output
map (\x -> negate (abs x)) [5,-3,-6,7,-3,2,-19,24]
map (negate . abs) [5,-3,-6,7,-3,2,-19,24]
#+End_src

#+RESULTS:
: [-5,-3,-6,-7,-3,-2,-19,-24*** Exception: <interactive>:1943:1-29: Non-exhaustive patterns in function map

*** List Functor in the repl
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output :tangle no
  :t map
  fmap (*2) [1..3]
  map (*2) [1..3]
i==i
#+end_src

#+RESULTS:
: map :: (t -> a) -> [t] -> [a]
: [2,4,6]
: [2,4,6*** Exception: <interactive>:2790:1-29: Non-exhaustive patterns in function map

*** Maybe Functor in the repl                                       :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output :tangle haskell/no
  :t fmap
  fmap (++ " HEY GUYS IM INSIDE THE JUST") (Just "Something serious.")
  fmap (++ " HEY GUYS IM INSIDE THE JUST") Nothing
  fmap (*2) (Just 200)
  fmap (*2) Nothing
  i==i
#+end_src

#+RESULTS:
: fmap :: Functor f => (a -> b) -> f a -> f b
: Just "Something serious. HEY GUYS IM INSIDE THE JUST"
: Nothing
: Just 400
: Nothing



*** Composition functions in the repl                               :B_block:
    :PROPERTIES:
    :BEAMER_env: block
    :END:
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output :tangle no
fmap ((+1).(*2)) (Just 3)
fmap (+1) (fmap (*2) (Just 3))
fmap  ((+1).(*2)) [1..5]
fmap (+1) (fmap (*2) [1..5])
1==1
#+end_src

#+RESULTS:
: Just 7
: Just 7
: [3,5,7,9,11]
: [3,5,7,9,11]

*** Infix fmap in the repl
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output :tangle no
(++) <$> Just "John " <*> Just "Travolta"
(++) "John " "Travolta"
1==1 
#+end_src

#+RESULTS:
: Just "John Travolta"
: John Travolta

*** Applicative Functors of lists in the repl
#+BEGIN_SRC haskell :session *plsHaskell* :exports both :results output :tangle no
[(*0),(+100),(^2)] <*> [1..4]
[(+),(*)] <*>[1,2]<*>[3,4]
(++) <$> ["ha","heh","hmm"] <*> ["?","!","."]
1==1
#+end_src

#+RESULTS:
: [0,0,0,0,101,102,103,104,1,4,9,16]
: [4,5,5,6,3,4,6,8]
: ["ha?","ha!","ha.","heh?","heh!","heh.","hmm?","hmm!","hmm."]

